In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'FAre':[25,48,71,85,90,120],
                'Embarked':['S','C','S','S','C','Q'],
                'Gender':['male','female','female','female','male','male'],
                'Age': [22,34,54,29,55,None]})

df

   FAre Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S  female  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q    male   NaN

# Encoder and Imputers

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
lab_enc= LabelEncoder()

In [5]:
df2=lab_enc.fit_transform(df['Embarked'])
pd.Series(df2)

0    2
1    0
2    2
3    2
4    0
5    1
dtype: int32

In [6]:
df['Embarked']=df2

In [7]:
df

   FAre  Embarked  Gender   Age
0    25         2    male  22.0
1    48         0  female  34.0
2    71         2  female  54.0
3    85         2  female  29.0
4    90         0    male  55.0
5   120         1    male   NaN

In [8]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer

In [9]:
ohe=OneHotEncoder()
si=SimpleImputer()

In [10]:
import pandas as pd

df=pd.DataFrame({'FAre':[25,48,71,85,90,120],
                'Embarked':['S','C','S','S','C','Q'],
                'Gender':['male','female','female','female','male','male'],
                'Age': [22,34,54,29,55,None]})

df

   FAre Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S  female  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q    male   NaN

In [11]:
ct=make_column_transformer(
(ohe,['Embarked','Gender']),
(si,['Age']),
remainder='passthrough')

In [12]:
 ct.fit_transform(df)

array([[  0. ,   0. ,   1. ,   0. ,   1. ,  22. ,  25. ],
       [  1. ,   0. ,   0. ,   1. ,   0. ,  34. ,  48. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  54. ,  71. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  29. ,  85. ],
       [  1. ,   0. ,   0. ,   0. ,   1. ,  55. ,  90. ],
       [  0. ,   1. ,   0. ,   0. ,   1. ,  38.8, 120. ]])

In [13]:
df

   FAre Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S  female  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q    male   NaN

# Ordinal Encoder

In [14]:
from sklearn.preprocessing import OrdinalEncoder

In [15]:
import pandas as pd
df=pd.DataFrame({'shape':['S','O','S','C'],
                'class':['t','f','s','f'],
                'size':['m','s','xl','m']})

df

  shape class size
0     S     t    m
1     O     f    s
2     S     s   xl
3     C     f    m

In [16]:
o_i=OrdinalEncoder(categories=[['f','s','t'],['s','m','xl']])
df1=o_i.fit_transform(df[['class','size']])

In [17]:
df1

array([[2., 1.],
       [0., 0.],
       [1., 2.],
       [0., 1.]])

In [18]:
df

  shape class size
0     S     t    m
1     O     f    s
2     S     s   xl
3     C     f    m

# Binary Encoder

In [19]:
import pandas as pd

In [20]:
df= pd.DataFrame({'cat_data' :['A','B','C','D','E','F','G','H','I','A','A','D']})
df

   cat_data
0         A
1         B
2         C
3         D
4         E
5         F
6         G
7         H
8         I
9         A
10        A
11        D

In [21]:
from category_encoders import BinaryEncoder
from sklearn.preprocessing import OneHotEncoder

In [22]:
bi_enc=BinaryEncoder()

1 count the number of categories(except duplicate)

In [23]:
df_bi=bi_enc.fit_transform(df)
df_bi

    cat_data_0  cat_data_1  cat_data_2  cat_data_3
0            0           0           0           1
1            0           0           1           0
2            0           0           1           1
3            0           1           0           0
4            0           1           0           1
5            0           1           1           0
6            0           1           1           1
7            1           0           0           0
8            1           0           0           1
9            0           0           0           1
10           0           0           0           1
11           0           1           0           0

# Comparing with OneHotEncoder

In [24]:
ohe=OneHotEncoder(sparse=False)
ohe.fit_transform(df[['cat_data']])

array([[1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.]])

# Knn imputer

In [29]:
df=pd.DataFrame({'salary':[25000,48000,71000,55000],
                'city':['satna','rewa','jabalpur','indore'],
                'gender':['male','female','female','male'],
                'exp':[1,3,6,None]})

df

   salary      city  gender  exp
0   25000     satna    male  1.0
1   48000      rewa  female  3.0
2   71000  jabalpur  female  6.0
3   55000    indore    male  NaN

In [26]:
from sklearn.impute import KNNImputer
knnimp=KNNImputer(n_neighbors=2)
knn_imp=pd.DataFrame(knnimp.fit_transform(df[['salary','exp']]))

knn_imp

         0    1
0  25000.0  1.0
1  48000.0  3.0
2  71000.0  6.0
3  55000.0  4.5

# lterative imputer

In [28]:
from sklearn.experimental import enable_iterative_imputer

from sklearn.impute import IterativeImputer

In [30]:
df=pd.DataFrame({'salary':[25000,48000,71000,55000],
                'city':['satna','rewa','jabalpur','indore'],
                'gender':['male','female','female','male'],
                'exp':[1,3,6,None]})

df

   salary      city  gender  exp
0   25000     satna    male  1.0
1   48000      rewa  female  3.0
2   71000  jabalpur  female  6.0
3   55000    indore    male  NaN

In [31]:
iter_imp= IterativeImputer()
i_m=pd.DataFrame(iter_imp.fit_transform(df[['salary','exp']]),columns=['salary','exp'])
i_m

    salary       exp
0  25000.0  1.000000
1  48000.0  3.000000
2  71000.0  6.000000
3  55000.0  4.094173